[
  { "routerUrl": "discount-living-rooms",
    "content": {
      "title": "Discount Living Room Furniture",
      "details": [
        "Rooms To Go Outlet features everything you need for your living room, with incredible deals that make it affordable to add comfort and livability to your home. Mix and match beautifully crafted sofas and accent tables available in plenty of color, style, and material options to assemble your desired room look. Need a new spot for your flat screen TV? Look no further than our overstock or unboxed entertainment centers, which are sure to please your family and visitors alike. Expertly crafted for an elegant look, our living room selections include sectionals, chairs, reclining sofas, and loveseats on sale, as well.",
        "Our discount living room furniture is available in varying styles that mesh well with traditional, casual, or contemporary design aesthetics. We also carry both upholstered leather and fabric furniture sets, including many featuring convenient additions such as sleepers with pull-out beds of many sizes and versatile ottomans. Each pre-assembled room collection provides a range of color and fabric options designed to enhance the look of your living room while saving you time and money. Choose from dark and light shades along with neutral or bright colors that catch the eye and highlight your sophisticated sense of style.",
        "Always available at great prices, our discount furniture presents the perfect chance to update your living room easily and economically. Whether it’s an unboxed floor sample or an overstock item, each of our products comes with a high standard of quality. Our furniture embodies excellence and is made to last. Inexpensive yet chic and luxurious, the selections of discount living room furniture available at Rooms To Go Outlet are the best way to get more for less."
      ],
      "products": [],
      "bannerImages": [],
      "categoryHierarchy": "Living Rooms"
    }
  },
  { "routerUrl": "discount-dining-rooms",
    "content": {
      "title": "Discount Dining Room Furniture",
      "details": [
        "Whether you’re having a casual family supper or hosting a formal dinner party, having the right dining room furniture is essential to any meal. Family and friends gather around <a href='/discount-dining-rooms/tables'>dining room tables</a>, sharing quality conversation from the comfort of their seats, whether it be a practical side chair or stately arm chair. Beautiful servers and exquisite china cabinets allow you to further accentuate your dining room while providing useful storage space at the same time. At Rooms To Go Outlet, we help you decorate your entire room, while preventing your bank account from feeling the pinch, with affordable prices on dining room furniture.",
        "Discount dining room furniture doesn’t mean inferior dining room furniture at Rooms To Go Outlet. We have a wide variety of high quality items on sale thanks to warehouse overstocks, unclaimed purchases and even unsold floor models. Our selections range from the luxurious to the contemporary and from the traditional to the rustic, so you’re sure to find great pieces in the style you desire. Made from sturdy wood solids and designed with function, comfort and fashion in mind, you will find only the best discount dining room furniture when you turn to Rooms To Go Outlet for your decorating needs.",
        "Inexpensive, stylish and downright beautiful, our discount furniture selections make your dining room look like it was pulled from the pages of a magazine. With new discount dining room furniture from Rooms To Go Outlet, your home will become the go-to place for family functions. Shop at Rooms To Go Outlet today, where our furniture is always on sale but never out of style."
      ],
      "products": [],
      "bannerImages": [],
      "categoryHierarchy": "Dining Rooms"
    }
  },
  {
    "routerUrl": "discount-bedrooms",
    "content": {
      "title": "Discount Bedrooms",
      "details": [
        "The wide selection of discount bedroom furniture at Rooms To Go Outlet makes finding the perfect pieces for your bedroom easier than ever. Find deals on matching 4 or 5-piece sets, or complete an entire room with a stylish 8-piece set featuring a variety of high-quality beds, nightstands, dressers, and chests from some of the top home furnishing brands in the country. Why pay high prices for the same kinds of furniture elsewhere? Browse our selection of overstock and floor model sets, and see for yourself how easy and inexpensive putting together a fantastic bedroom can be.",
        "Choose from a number of different deals including beds matched with dressers and mirrors, paired nightstands, or chests of drawers. Build your bedroom with individual pieces finished in classy, comforting dark cherry stains, or opt for lighter tones of rustic, natural pine wood. A wide range of color and finish options await, ensuring the right furniture to fit your decor style.",
        "With unbeatable selections of discount bedroom furniture, savvy shoppers can find high-quality, stylish bedroom sets on sale for inexpensive prices. Our inventory of overstock and floor model furniture items moves quickly, so don’t wait. Shop at Rooms To Go Outlet today for all your bedroom furniture needs."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [],
      "categoryHierarchy": "Bedrooms"
    }
  },
  {
    "routerUrl": "discount-leather",
    "content": {
      "title": "Discount Leather Sofas",
      "details": [
        "Finding the perfect furniture to outfit your living room can be a time-consuming and money-draining process. At Rooms To Go Outlet, we offer the best deals on decorator sets of high quality furniture so you can furnish your home in the most efficient way possible. Purchase from our selection of floor models, overstock items, and scratch and dent pieces to get like-new leather furniture on sale at incredibly low prices. You can purchase discount leather living room furniture from Rooms To Go Outlet in sets of up to eight, but individual items are available separately, as well.",
        "Give your home a polished look with our gorgeous genuine top grain leather furniture. Living room sets may include sofas, loveseats, recliners, sectionals, and even ottomans. To ensure your new discount leather living room furniture is exactly as you like it, we offer various color options, including gradations of red, white, and brown. Our living room furniture does more than simply offer you a place to sit and relax after a long day. Many pieces also feature storage space or built-in recliners for added functionality, and every piece gives your home a chic, stylish look.",
        "The collections you’ll find at Rooms To Go Outlet cannot be matched in terms of style. Since our customers’ tastes represent a wide range of design aesthetics, we carry affordable leather living room furniture to match countless styles of home decor. Choose from pieces that reflect the latest trends or opt for more traditionally designed furniture. Either way, our inexpensive selections will give you the living room you’ve always wanted without overextending your wallet. Take a look at Rooms To Go Outlet and find what you’ve been missing."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Leather"
    }
  },
  {
    "routerUrl": "discount-mattress",
    "content": {
      "title": "Discount Mattress",
      "details": [
        "Mattress sets shouldn’t be outrageously expensive. Here at Rooms To Go Outlet, you won’t have to sacrifice quality for lower prices. We carry numerous name brand, high quality discount mattresses so you can sleep comfortably for less. Our extensive selection includes models featuring cutting-edge gel memory foam technology, individually wrapped innerspring coils, and even hypoallergenic, body-contouring latex. We also have great deals on floor samples and overstock mattresses that are ready for the taking.",
        "Since different people have different preferences in terms of the level of firmness in a mattress, we stock a wide range of affordable mattresses to cater to each customer’s individual needs. From firm and restorative to plush and luxurious, our mattresses will lull you into one restful night of sleep after another. And don’t forget about the box spring! In addition to standard height foundations, we also sell low profile options that allow you to situate your mattress closer to the ground. Other available accessories include mattress protectors, which preserve the integrity of your new discount mattress, and our hardily constructed bed frames. These inexpensive extras ensure that your purchase lasts as long as possible, keeping you comfortable and your wallet fat.",
        "We spend approximately one-third of our lives in bed, so if you’re unsatisfied with your current mattress, do yourself a favor and act now. We have all of the top mattresses at Rooms To Go Outlet, and they’re always on sale. Finally get the sleep of your dreams by picking up one of our discount mattresses today"
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Mattress"
    }
  },
  {
    "routerUrl": "discount-home-decor",
    "content": {
      "title": "Discount Home Decor",
      "details": [
        "Even the nicest home feels incomplete without a touch of decoration. Rooms To Go Outlet offers discount home decor pieces that are sure to brighten your living space without making a huge dent in your wallet. Our affordable selection of warehouse overstock, floor samples, and one-of-a-kind home decor includes deals on rugs, accent cabinets, lamps, decorative chairs, wall decor, and accent tables, along with many other room-specific pieces.",
        "Choose from a wide selection of wall art ranging from paired sets of framed watercolor prints to large gallery-wrapped acrylic works of art on hand-finished canvases. Browse our large selection of accent consoles, cabinets and chairside tables, which offer stylish storage options ideal for any room. Add attractive yet functional seating to your living space with an inexpensive accent chair, or tie the room together with a colorful rug.",
        "Each piece of discount home decor is made with quality and style in mind. Crafted from the finest wood, metal, and fabric material, every chair, lamp, pillow, and table is sure to make a lasting statement in your home. Shop with Rooms To Go Outlet and spice up your home with unbeatable deals on high-quality discount home accessories."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Home Decor"
    }
  },
  { "routerUrl": "discount-living-rooms/sofas",
    "content": {
      "title": "Discount Sofas",
      "details": [
        "At Rooms To Go Outlet, we offer a wide variety of quality sofas at discount prices. From the clean lines and designer look of modern styles, to our more traditional selections featuring padded rolled arms and overstuffed cushions, we carry a wide range of sofas to ensure you’ll find one that will fit attractively into your home. And all at an inexpensive price point that will keep you on budget!",
        "Our discount sofas are designed to fit your individual style and help define your room aesthetic perfectly. Choose from leather options in cool creams, chic blacks, or natural brown tones. Looking to make a more daring statement with bold patterns or prints? We have that, too, in various color palettes including reds, greens, blues, and earth tones. Upholstered in soft but durable materials, our sofas are built to stand the test of time without forsaking a sense of style.",
        "We are able to offer such great sofa deals at Rooms To Go Outlet due to our range of overstock inventory and unused floor samples. With us, on sale still means quality. In addition to traditional, modern, and leather options, some of our quality crafted sofas even feature premium details such as Feather Blend seating for the ultimate in plush relaxation. With such a wide selection of comfortable discount sofas to choose from, your only question should be, “How soon can I sit down?"
      ],
      "products": [],
      "bannerImages": [
        {
          "url":"banners/sofas.jpg",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Sofas/_/N-8ez"
        },
        {
          "url":"banners/sofas_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Sofas/_/N-8ez"
        }
      ],
      "categoryHierarchy": "Living Rooms > Sofas"
    }
  },
  { "routerUrl": "discount-living-rooms/sleeper-sofas",
    "content": {
      "title": "Discount Sleepers",
      "details": [
        "Rooms To Go Outlet discount sleeper sofas offer a great solution for unexpected overnight guests. No spare room? No problem! Our inexpensive selections fold out into sturdy queen-size beds, providing a restful night’s sleep while saving space. Each discount sleeper sofa provides comfortable, stylish seating in your living room when it’s not needed as a bed, just like a regular sofa. With brand-name innerspring and gel memory foam mattress options available, you’ll feel great about offering up your new sleeper as a bed to guests. Built from sturdy materials and upholstered in durable fabrics, our sleeper sofas are designed to withstand even heavy use and are easy to clean.",
        "Since our affordable sleeper sofas come in a variety of designs, you’re sure to find what you’re looking for, whether it’s clean, contemporary lines or a classically styled traditional look. We carry a wide selection of color options ranging from natural and muted earth tones to bright and bold reds, greens, and oranges. Our pieces also feature fun and trendy accents like beautiful inlays, button tufting, nailhead trim, and gorgeous accent pillows. Whether you enjoy the luxurious feel of leather or prefer plush MicroFiber, we have the discount sleeper sofa that will make you happy and keep your overnight guests comfy.",
        "Finding deals at Rooms To Go Outlet is easy because our pieces are always on sale. Choose from an assortment of discount sleeper sofas, including floor samples, to find your next living room piece without breaking your budget. Lounge the day or night away on the perfect sleeper sofa, found at reasonable overstock prices only from Rooms To Go Outlet."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Sleepers/_/N-8f1"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Sleepers/_/N-8f1"
        }
      ],
      "categoryHierarchy": "Living Rooms > Sleepers"
    }
  },
  { "routerUrl": "discount-living-rooms/reclining-sofas",
    "content": {
      "title": "Discount Reclining Sofas",
      "details": [
        "Picking out the perfect couch can be a hassle, but the amazing deals on discount reclining sofas at Rooms To Go Outlet make finding a quality seat fun. With many different styles and colors to choose from, you’re sure to find a piece that fits both your fashion sense and your budget. So put your feet up, lean back, and relax because we’re here to help you find a perfect and delightfully inexpensive reclining sofa",
        "Rooms To Go Outlet offers a diverse selection of casual and contemporary discount reclining sofas in all colors of the rainbow. Our impressive assortment of overstock items makes it easy to find a sofa to blend well with any room in your house. Choose from luxurious, double stitched leather or soft, supple MicroFiber fabric. Looking for chaise-style footrests? Overstuffed seats that recline completely flat? Pillowtop armrests? Extra-wide seating with full leg support? You can find a discount reclining sofa with all of this and more on sale at any of our convenient outlet locations.",
        "We promise you’ll love our deals on affordable reclining sofas so much, you’ll be inspired to select the perfect piece on the spot. Just think of the relaxation level you’ll achieve once you finally own a blue MicroFiber reclining sofa with overstuffed back cushions or a brown leather dual reclining sofa with accent pillows included. The possibilities are endless. Socialize with family and friends in comfort, lay back and rest your eyes for a minute while watching the big game, or sink comfortably into the sofa for an all-day TV binge. No matter the situation, a discount reclining sofa from Rooms To Go Outlet is sure to enhance your everyday life."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Reclining-Sofas/_/N-8f0"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Reclining-Sofas/_/N-8f0"
        }
      ],
      "categoryHierarchy": "Living Rooms > Reclining Sofas"
    }
  },
  { "routerUrl": "discount-living-rooms/loveseats",
    "content": {
      "title": "Discount Loveseats",
      "details": [
        "If there’s one thing that shouldn’t cost you excessive amounts of money or stress, it’s the ability to cuddle up to your loved ones. Our selection of discount loveseats provides you with many chic and comfortable choices that won’t put a strain on your bank account, but will facilitate endless nights of movie watching or reading in tandem. Check out Rooms To Go Outlet for incredible deals on simple, elegant pieces perfect for couples with classic tastes, or modern loveseats that help you make a bold, stylish statement. Whatever your collective style, we’re confident you’ll find a discount loveseat that complements the existing decor of your home.",
        "Our loveseats add cozy comfort to any room. Place one in your library for afternoons curled up with a book or set the loveseat in your living room for nights spent snuggling in front of the television. You can even add a discount loveseat to your guest room to treat your guests to plush luxury. Our impressive color selection ranges from deep blues and rich reds to more traditional shades of sophisticated tan and chic black. Upholstered in durable fabrics like cotton and leather, discount loveseats from Rooms To Go Outlet remain in favorable condition no matter how much traffic they endure. We have the look and feel you’ve been seeking in a loveseat, and all of our pieces are always on sale.",
        "Each Rooms To Go discount loveseat is designed with impeccable style. Unique color options like wasabi green and hydra blue show off your playful side, while embellishments like exposed nailheads, contrasting stitching detail, and tapered legs make these inexpensive pieces pop. Additionally, patterned accent pillows and reversible cushions help keep our loveseats looking fresh and fun. Browse our selection of overstock loveseats for indulgently comfortable furniture that doesn’t require outrageous spending."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Loveseats/_/N-8f6"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Loveseats/_/N-8f6"
        }
      ],
      "categoryHierarchy": "Living Rooms > Loveseats"
    }
  },
  { "routerUrl": "discount-living-rooms/chairs",
    "content": {
      "title": "Discount Living Room Chairs",
      "details": [
        "Our Rooms To Go Outlet discount chairs are more than just a place to rest. Simple yet stylish, our chairs enhance the decor of any room and make your home look worthy of being featured in a magazine. The best part is that we never make you pay full price. Our comfortable discount chairs are available in a number of styles and you’ll always find deals on unused floor samples and warehouse overstock. Thanks to Rooms To Go Outlet, you don’t have to punish your bank account to properly decorate your home.",
        "Whether you’re looking for a fun swivel chair or a traditional club chair, we stock pieces in a variety of styles so you’re sure to find the look you need to fit any room in your home. Each discount chair features desirable design elements, such as comfy, overstuffed arms. Our affordable selections come in many different colors and are upholstered in woven fabric, leather, and Microfiber. We even offer discount chairs featuring beautiful prints and chic patterns for a look that is truly unique. Built from sturdy wood and metal materials, our chairs are designed to last, looking like new.",
        "We always sell our chairs at sale prices, but we never slack on quality. Inexpensive in cost yet priceless in value and design, discount chairs from Rooms To Go Outlet will make you the envy of all your guests. Buying new furniture doesn’t have to cost an arm and leg. When shopping at Rooms To Go Outlet, the only difficulty you will face is choosing which of our discount chairs appeals to you the most."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Chairs/_/N-8fa"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Chairs/_/N-8fa"
        }
      ],
      "categoryHierarchy": "Living Rooms > Chairs"
    }
  },
  { "routerUrl": "discount-living-rooms/ottomans",
    "content": {
      "title": "Discount Ottomans",
      "details": [
        "You’ll find amazing deals on discount ottomans at Rooms To Go Outlet. Our selection of quality crafted pieces is sure to please, as our discount-savvy buyers have access to the most stylish upholstered designs. Made with high-quality materials, you won’t find better deals on our ottoman options featuring fabric, leather, and MicroFiber materials. Liven up any room with a chic standard ottoman, or opt for one of our fashionable ottomans complete with storage functionality. Adding character to any room, our affordable cocktail ottomans are unrivaled in design and quality.",
        "Casual, contemporary, traditional, and transitional designs are available in a range of sizes and shapes to suit just about any particular taste. With an array of colors to choose from, a variety of options to fit your existing home decor is available. Colors include shades of beige, black, white, red, and blue. While solid colors are always chic, so are fashionable prints and patterns. Select from patterns that pop or more subtle options that enhance the style of your existing furniture.",
        "No relaxation area is complete without an inexpensive ottoman to complement your room’s design. Although a small piece of the puzzle, ottomans provide the sense of comfort and serenity every home should have. Available at unbeatable prices, our floor samples and overstock items are poised to add great value to your room. Purchase a discount ottoman from Rooms To Go Outlet today and save money without compromising quality."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Sleepers/_/N-8f1"
        }
      ],
      "categoryHierarchy": "Living Rooms > Ottomans"
    }
  },
  { "routerUrl": "discount-living-rooms/recliners",
    "content": {
      "title": "Discount Recliners",
      "details": [
        "Coming home at the end of a long day and sinking into the comfort of a Rooms To Go Outlet discount recliner is an experience like no other. The cares of the day melt away as you relax and put your feet up. The best part is, each recliner we carry is as affordable as it is cozy. You can find supreme deals on unused floor samples, closeout specials, warehouse overstock, and other discounted options. Savvy shoppers will relish the experience of purchasing one of our discount recliners that provide every bit as much quality and comfort as full-priced options, only at terrific values.",
        "Our impressive selection of discount recliners allows customers to choose from different materials, colors, and features. Find the perfect burgundy MicroFiber swivel glider recliner with memory foam cushions and a chaise style footrest, or opt for an overstuffed leather recliner with a padded headrest and decorative contrasting stitching. Some models even feature luxurious and innovative characteristics such as lay-flat reclining mechanisms, spill-resistant fabrics, and power touch reclining for effortless relaxation.",
        "Recliners available at Rooms To Go Outlet come in such a wide variety, you’re sure to find a great, inexpensive piece that will quickly become the best seat in your house. You deserve both comfort and quality without having to break the bank. So sit back, relax, and enjoy the plush, cushioned feel of a premium discount recliner, on sale only at Rooms To Go Outlet."
      ],
      "products": [],
      "bannerImages": [
        {
          "url":"banners/recliners.jpg",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Recliners/_/N-8f9"
        },
        {
          "url":"banners/recliners_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Recliners/_/N-8f9"
        }
      ],
      "categoryHierarchy": "Living Rooms > Recliners"
    }
  },
  { "routerUrl": "discount-living-rooms/chaise-lounges",
    "content": {
      "title": "Discount Chaise Lounges",
      "details": [
        "Sometimes you want a touch of luxury when it’s time to relax. However, the look of luxury doesn’t have to cost a fortune. With discount chaise lounges from Rooms To Go Outlet, you can relax in style without breaking the bank. Choose from a variety of inexpensive floor samples, store overstock, and closeout specials without having to sacrifice elegance and quality. When you shop at Rooms To Go Outlet, you are sure to find the right look at the right price.",
        "Made from only the finest materials, our affordable chaise lounges offer incredible comfort and panache. Choose from a variety of colors and fabrics, each designed to withstand everyday use and clean up easily when faced with inevitable spills. Choose from stunning leather options in various shades or more contemporary styles with clean lines and sturdy legs. Looking for something more ornate? How about a discount chaise lounge adorned in a gorgeous pattern to take your home decor to a whole new level? Rooms To Go Outlet has you covered.",
        "The number of deals we have on our extensive collection of discount chaise lounges makes it easy to fulfill your desire to glamorize your living space. Lounge comfortably with your legs supported on any of our discount chaise lounges, on sale now at a Rooms To Go Outlet location near you."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Chaises/_/N-8fj"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Chaises/_/N-8fj"
        }
      ],
      "categoryHierarchy": "Living Rooms > Chaises"
    }
  },
  { "routerUrl": "discount-living-rooms/entertainment-center",
    "content": {
      "title": "Discount Entertainment Center",
      "details": [
        "If you’re in need of an entertainment center for your living room, den, or office, look no further than Rooms To Go Outlet. Choose from a wide selection of styles and colors, ranging from simple two-shelf consoles to 90 inch wall units with cabinets, drawers, bookshelf piers, and built-in electric fireplaces. Thanks to factory overstocks, discontinued items, and other deeply discounted products, many entertainment centers at Rooms To Go Outlet are on sale for inexpensive prices at or below cost.",
        "Add warmth to your living space with deep, rustic hues of dark cherry, oak, or distressed walnut, or opt for brighter colors such as turquoise, white, or cream to perk up a room. Many of our discount entertainment centers come with metal accents and cabinet hardware, available in brushed bronze, chrome, gunmetal, or antique brass finishes. Tech-savvy consumers will be pleased to find that most of our options contain pass-through holes for electronic cables and power cords, as well as ventilated back cutouts to keep media equipment from overheating.",
        "Most consoles accommodate TVs of up to 60 inches, while some larger pieces hold TVs as large as 85 inches. We also carry a wide selection of wall unit models sporting convenient shelves, drawers, or cabinets to contain or display electronics, books, movies, games, or decorative knickknacks. Discover the value of a discount entertainment center from Rooms To Go Outlet today."
      ],
      "products": [],
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Home-Entertainment/_/N-8ff"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Home-Entertainment/_/N-8ff"
        }
      ],
      "categoryHierarchy": "Living Rooms > Home Entertainment"
    }
  },
  { "routerUrl": "discount-living-rooms/coffee-table-sets",
    "content": {
      "title": "Discount Coffee Table Sets",
      "details": [
        "When paired with matching end tables, a good coffee table adds a unifying element of class and style to any room. Rooms To Go Outlet carries a large variety of affordable coffee table sets which can turn your living room, den, or great room into a comfortable entertaining space by providing an attractive spot to rest a beverage, place a lamp, or store clutter out of sight. Find deals on quality floor samples, manufacturer closeouts, and warehouse overstock coffee table sets at inexpensive prices.",
        "Rooms To Go Outlet offers discount coffee table sets to fit all tastes and budgets, from the contemporary feel of a sleek 3-piece glass top set with metal legs, to the classic look of a rectangular wooden cocktail table with a dark cherry finish and matching end tables. You can find deals on round, square, rectangular, or oval coffee tables with display shelves, drawers, or lift-top storage compartments, complete with matching end tables that really tie the room together. The next time company comes over to visit, your guests will be impressed by your exquisite taste in furniture.",
        "Stop by a Rooms To Go Outlet store to find a quality discount coffee table set on sale for prices well below cost. Browse our wide selection of matching sets and individual tables and find the perfect table to add style, storage space, and class to your home."
      ],
      "products": [],
      "bannerImages": [
        {
          "url":"banners/coffee_tables.jpg",
          "link": "https://www.roomstogo.com/furniture/Living-Rooms/Cocktail-Tables/_/N-8u0"
        },
        {
          "url":"banners/coffee_tables_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Living-Rooms/Cocktail-Tables/_/N-8u0"
        }
      ],
      "categoryHierarchy": "Living Rooms > Cocktail Tables"
    }
  },
  { "routerUrl": "discount-dining-rooms/dining-set",
    "content": {
      "title": "Discount Dining Room Sets",
      "details": [
        "The impressive selection of discount dining room sets at Rooms To Go Outlet makes it easy to update your home by mixing and matching chairs and tables without having to spend a fortune. How is this possible? Our floor samples, overstock, and scratch and dent products save you tons of money while placing the dining room of your dreams within your reach. Our available stock accommodates both simple and decadent decorating styles, as well as every preference in-between.",
        "Because most dining rooms center around the perfect table, it is pivotal to choose one that not only fits the room but one that you are pleased to eat at every day. Imagine family dinners seated around a cozy, traditional set, or visualize modernizing your living space with a chic contemporary discount dining room set. We sell affordable traditional, transitional, contemporary, and casual collections featuring your choice of rectangular, round, or square tabletop options as the centerpiece. Further customize your choice by selecting a tempered glass or wood-finished surface and counter or standard table heights.",
        "Don’t forget about our enticing yet inexpensive options with features such as convenient underside storage cubbies and leaf extensions. Have a particular finish or wood type in mind? We use quality crafted materials and offer plenty of color and finish options to satisfy even the most eccentric of tastes. Don’t needlessly waste your money on overpriced sets from other companies. Buy an exquisite discount dining room set from Rooms To Go Outlet today!"
      ],
      "images": [],
      "mainImage": {
        "url": "Dinning_Header.jpg"
      },
      "bannerImages": [
        {
          "url": "banners/dining_room_sets.jpg",
          "link": "https://www.roomstogo.com/furniture/Dining-Rooms/Dining-Room-Sets/_/N-8e7"
        },
        {
          "url": "banners/dining_room_sets_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Dining-Rooms/Dining-Room-Sets/_/N-8e7"
        }
      ],
      "categoryHierarchy": "Dining Rooms > Dining Room Sets"
    }
  },
  { "routerUrl": "discount-dining-rooms/tables",
    "content": {
      "title": "Discount Dining Tables",
      "details": [
        "When searching for a new dining room table, it’s hard to find quality and style at an inexpensive price. Rooms To Go Outlet offers an extensive inventory with incredible deals on all styles of discount dining tables. Our large selection of warehouse overstock items allows us to offer our customers numerous style options at prices well below market value.",
        "We make it easy to pick out an appropriately sized table for your dining space with selections that seat two, four, or even upwards of six people at a time. Some of our discount dining tables even include leaves, giving you the option to extend the tabletop to accommodate larger dinner parties. All of our available discount dining tables are chic and sturdy, so whether you are drawn to an elegant black glass top modern table or an oak finished option with rustic country flair, you’ll never have to compromise on style or quality. From casual to contemporary and everything in between, we promise you’ll find an affordable dining table you love at Rooms To Go Outlet.",
        "Whether crafted from tempered glass, wood solids, or woven rattan, each dining table is designed with lasting durability in mind. You’ll find great deals on dining tables with convenient features, such as built-in drawers, wine racks, or leaves that expand the overall surface area. Choose Rooms To Go Outlet and pick out the perfect discount dining table to suit your style and budget."
      ],
      "images": [],
      "mainImage": {
        "url": "Dinning_Header.jpg"
      },
      "bannerImages": [
        {
          "url": "banners/dining_tables.jpg",
          "link": "https://www.roomstogo.com/furniture/Dining-Rooms/Dining-Tables/_/N-8e8"
        },
        {
          "url": "banners/dining_tables_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Dining-Rooms/Dining-Tables/_/N-8e8"
        }
      ],
      "categoryHierarchy": "Dining Rooms > Dining Tables"
    }
  },
  { "routerUrl": "discount-dining-rooms/side-chairs",
    "content": {
      "title": "Discount Dining Room Side Chairs",
      "details": [
        "Having plenty of seating is an essential component of any good dining room. At Rooms To Go Outlet, you can browse a large selection of discount side chairs that fit your style preferences as well as your budget. While other furniture retailers may put a big price tag on quality and design, our inventory of unused floor models, warehouse overstock pieces, and closeout specials allows us to offer deep discounts on side chairs and other inexpensive pieces of furniture to complete your dining room.",
        "When you come check out our available styles of affordable side chairs, you’ll find a variety of upholstered options, quality wood materials, eye-catching colors, and fashion-savvy designs. Sit in rustic comfort on a country-cottage inspired wooden chair with slat backing, or go for our chic and sleek upholstered options with contemporary chrome legs. No matter the style, each discount side chair is built with quality and durability in mind.",
        "Your personal style is unique, and the range of color and finish options at Rooms To Go Outlet makes it easy to find a side chair on sale that fits perfectly with the existing furniture in your dining room. Stop by a location near you and see how easy and inexpensive finding the perfect side chair can be."
      ],
      "images": [],
      "mainImage": {
        "url": "Dinning_Header.jpg"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Dining-Rooms/Side-Chairs/_/N-8ea"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Dining-Rooms/Side-Chairs/_/N-8ea"
        }
      ],
      "categoryHierarchy": "Dining Rooms > Side Chairs"
    }
  },
  { "routerUrl": "discount-dining-rooms/china-cabinets",
    "content": {
      "title": "Discount China Cabinets",
      "details": [
        "China cabinets and hutches create an exquisite showcase for your most delicate porcelain, in addition to adding a touch of class to any room. Naturally, you can store more than just china within these versatile cabinets—vases and other eye-catching trinkets also make for intriguing displays. Rooms To Go Outlet offers discount china cabinets that are inexpensive yet beautiful. You won’t find a better deal on these artfully crafted pieces anywhere else.",
        "Our china cabinets are always on sale and constructed from quality wood solids including pine, poplar, and birch. Increase the functionality of your dining room by selecting a discount china cabinet with additional wine storage or a built-in bottle opener. If you need additional closed storage space, we have you covered. Many of our selections include wooden or opaque cabinet doors. Destined to become the centerpiece of your dining room, many china cabinets await at our discount outlet stores.",
        "Whether it’s felt-lined drawers, interior touch lighting, or mirrored backdrops that you crave, our selection of discount china cabinets will serve your needs. Our floor samples and overstock items are high quality and available at the most inexpensive prices imaginable. Save some money and purchase a china cabinet from Rooms To Go Outlet, where quality comes at an incredibly affordable price."
      ],
      "images": [],
      "mainImage": {
        "url": "Dinning_Header.jpg"
      },
      "bannerImages": [
        {
          "url": "banners/china_cabinets.jpg",
          "link": "https://www.roomstogo.com/furniture/Dining-Rooms/China-Cabinets/_/N-8eb"
        },
        {
          "url": "banners/china_cabinets_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Dining-Rooms/China-Cabinets/_/N-8eb"
        }
      ],
      "categoryHierarchy": "Dining Rooms > China Cabinets"
    }
  },
  { "routerUrl": "discount-dining-rooms/benches",
    "content": {
      "title": "Discount Dining Room Benches",
      "details": [
        "Dining room tables don’t always have to be surrounded by chairs anymore. If you’re a fan of family style seating, try a discount bench from Rooms To Go Outlet. Bench seating works well in tight areas and kitchens and helps conserve vertical space since the bench can be stored directly underneath the table when not in use. Dining benches are also a great option for anyone looking for a rustic or casual look. Due to warehouse overstock, manufacturer closeouts, and unsold floor models, Rooms To Go Outlet can offer exceptional sale prices on brand new items.",
        "Our discount benches are designed to seamlessly blend with any room decor, from contemporary designs to more traditional pieces. At Rooms To Go Outlet, we offer affordable benches in varying heights for use with a dining table, kitchen counter, or even at an island. Made from durable materials to stand the test of time, our discount dining benches are available in a variety of wood finishes, some with upholstered seats for added comfort, and many available in various color palettes to match your personal tastes.",
        "Decorating your dining room is your opportunity to mix the eclectic with the traditional, and choosing a discount bench is a great way to give your dining space a fresh new look. Save space, save money, and enjoy all the benefits of brand new furniture from Rooms To Go Outlet."
      ],
      "images": [],
      "mainImage": {
        "url": "Dinning_Header.jpg"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Dining-Rooms/Benches/_/N-8ee"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Dining-Rooms/Benches/_/N-8ee"
        }
      ],
      "categoryHierarchy": "Dining Rooms > Benches"
    }
  },
  { "routerUrl": "discount-dining-rooms/servers",
    "content": {
      "title": "Discount Dining Room Servers",
      "details": [
        "When planning the perfect dinner party, you’ll want a place to arrange your delectable spread. Don’t go searching for your old card table when you can bring home a beautiful discount server or buffet from Rooms To Go Outlet for a steal. Adding such a lovely, versatile piece of furniture to your dining room won’t hurt your wallet, as our affordable servers come from warehouse overstocks, unclaimed orders, and like-new floor samples.",
        "Our discount buffets and servers are built to last with only the highest quality wood solids and metal materials. Available in a variety of styles to fit nearly any decor, our selections complement your existing furnishings and serve as a stylish and functional accessory for your dining room. Choose from the sleek lines and modern stylings of a contemporary server, or go for the classic, elegant look of a traditional piece. With natural wood veneers, chic finish selections, and unique design touches, the perfect discount server is waiting for you at Rooms To Go Outlet.",
        "Whether you need some extra space to store your fine china or are looking for a functional home for your wine collection, our discount servers fulfill multiple purposes and desires at inexpensive prices. Many options even feature convenient details such as felt-lined drawers for silverware storage, built-in wine bottle racks, or hanging wine glass storage. So when you’re looking for a place to lay out a memorable buffet-style spread but don’t want to pay a pretty penny to do so, check out Rooms To Go Outlet for all your dining room server needs."
      ],
      "images": [],
      "mainImage": {
        "url": "Dinning_Header.jpg"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Dining-Rooms/Servers/_/N-8ec"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Dining-Rooms/Servers/_/N-8ec"
        }
      ],
      "categoryHierarchy": "Dining Rooms > Servers"
    }
  },
  {
    "routerUrl": "discount-bedrooms/bedroom-sets",
    "content": {
      "title": "Discount Bedroom Sets",
      "details": [
        "Your bedroom should be a source of relaxation from the word go. That’s why we make decorating your sanctum easier than ever here at Rooms To Go Outlet. We offer 5, 7 and 8 piece matching discount bedroom sets for you to peruse, so all you have to do is pick out the affordable pre-packaged combination of beds, dressers, mirrors, nightstands and media chests and then take your new furniture home. Since we pull our inventory from warehouse overstock and gently used floor samples, you won’t even have to dip into your rainy-day savings to pay for these glamourous and hassle-free sets.",
        "Just because our discount bedroom sets cost you less doesn’t mean we compromise on quality or sophistication, either. In fact, our inexpensive pieces are so diversely stylized, we dare you to walk through a Rooms To Go Outlet location and not find a discount bedroom set that appeals to your exact tastes. We carry affordable beds in every style on the market, from poster to sleigh, from panel to canopy and everything in between. We also have sets in every available finish, so you have your choice of countless natural wood tones, calming creams, bold blacks or wonderful whites. Indulge your lavish side with extravagantly crafted headboards and uniquely shaped mirrors or opt for simplicity with classic lines and smooth silhouettes.",
        "Since our sets are always on sale, you won’t have to feel bad treating yourself to all the luxurious design features. From felt-lined drawers perfect for your delicates to slide-out trays that help you organize your jewelry, our furniture is designed with convenience in mind. Your ideal bedroom is no longer just a distant dream. Visit a Rooms To Go Outlet store to pick up a discounted bedroom set and make nightly relaxation your reality."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "banners/bedroom_sets.jpg",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
        },
        {
          "url": "banners/bedroom_sets_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
        }
      ],
      "categoryHierarchy": "Bedrooms > Queen Bedroom Sets"
    }
  },
  {
    "routerUrl": "discount-bedrooms/queen-bedroom-sets",
    "content": {
      "title": "Discount Queen Bedroom Sets",
      "details": [
        "At Rooms To Go Outlet, you’ll find fantastic deals on discount queen bedroom sets that range in style from the classical and elegant to the hip and modern. Save big on our inexpensive overstock furniture by purchasing an entire 5 piece, 7 piece, or 9 piece queen bedroom set. Each piece in the set features a coordinating design, so you won’t have to worry about putting together a fashionable, cohesive bedroom. We’ve already done it for you.",
        "Better still, you can pick out the pieces that appeal to you most and build queen size bedroom sets to fit your specific needs. Options include nightstands, media chests, dressers, mirrors, beds and individual headboards. Choose from elegant canopy beds, grand poster beds, low platform beds, traditional sleigh beds and more. For an extra touch of comfort, you can purchase a discount queen bedroom set with a padded or tufted headboard or choose one that offers additional storage space for your clothes, books and linens.",
        "Our discount queen bedroom sets come in a variety of finish options. Modern color schemes range from black and white to silver and gray, while our traditional palettes include dark oak, cherry and mahogany hues. Whatever your definition of comfort is, you can find it at Rooms To Go Outlet. Come shop our vast selection of unused floor samples, factory closeouts and brand new furniture on sale at affordable prices you won’t find anywhere else."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "banners/bedroom_sets.jpg",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
        },
        {
          "url": "banners/bedroom_sets_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
        }
      ],
      "categoryHierarchy": "Bedrooms > Queen Bedroom Sets"
    }
  },
  {
    "routerUrl": "discount-bedrooms/king-bedroom-sets",
    "content": {
      "title": "Discount King Bedroom Sets",
      "details": [
        "There’s just something about king-sized beds that make you feel like royalty, and here at Rooms To Go Outlet, we make it easier than ever to give yourself the royal treatment with our discount king bedroom sets. We offer attractive furniture designed to complement any home decor. With options ranging from traditional poster to modern platform style king beds as the centerpiece, our inexpensive bedroom sets will please your inner decorator. And since our king bedroom sets come with multiple pieces, it’s never been simpler to outfit your entire bedroom. The best part? You don’t have to break the bank to do it because our king bedroom sets are always on sale.",
        "Each discount king bedroom set is made from the best materials and will stand the test of time, all while looking like they were pulled straight from the pages of a magazine. We source our selections from warehouse overstock, floor samples and unclaimed orders to ensure you get the bedroom you’ve always wanted at affordable prices you’ve only dreamed of. Choose from a variety of wood tones, like rich cherry or dark oak, or opt for sets in sleek, modern colors like gray or black. We also have selections available in classically beautiful white.",
        "Our deals on discount king bedroom sets will get you the furniture you need for a great price. Whatever style you choose, your bedroom will be transformed into the beautiful oasis you’ve always wanted. Visit a Rooms To Go Outlet store today so you can start retreating to your kingdom in comfort."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/King-Bedroom-Sets/_/N-8dc"
      },
      "bannerImages": [
        {
          "url": "banners/bedroom_sets.jpg",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/King-Bedroom-Sets/_/N-8dc"
        },
        {
          "url": "banners/bedroom_sets_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/King-Bedroom-Sets/_/N-8dc"
        }
      ],
      "categoryHierarchy": "Bedrooms > King Bedroom Sets"
    }
  },
  {
    "routerUrl": "discount-bedrooms/queen-beds",
    "content": {
      "title": "Discount Queen Beds",
      "details": [
        "As stylish as they are affordable, discount queen beds from Rooms To Go Outlet offer the perfect way to upgrade your bedroom without breaking the bank. With everything from overstock models to showroom floor samples on sale, you’re sure to find the discount queen bed that fits your budget perfectly. Rest assured, it’ll look great, too. Because finding a great deal on bedroom furniture shouldn’t mean that you have to compromise when it comes to style.",
        "Our ever-changing inventory at Rooms To Go Outlet ensures that you’ll always find a variety of discount queen beds to choose from. From classic sleigh beds to contemporary platform styles, our selections deliver the look you want at an inexpensive price you can afford. Some of our most popular models incorporate the sleek elegance of metal into the design, while others are made entirely of richly finished wood solids that bring an air of sophisticated luxury into the bedroom. You’ll be the only one who knows what a steal it really was.",
        "Whether your tastes skew modern or traditional, there’s a discount queen bed for you at Rooms To Go Outlet. Choose a vibrantly colored bed frame that shows off your bold sense of style, or go for something minimalist that matches your existing furniture while still offering a unique expression of your personal taste in bedroom decor. For those who prioritize functionality, some of our beds even feature spacious storage drawers built right into the footboard and rails. When you’re ready to save, simply select a discount queen bed from our outlet inventory. Your wallet will thank you later."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Beds/_/N-8dd"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Queen-Beds/_/N-8dd"
        }
      ],
      "categoryHierarchy": "Bedrooms > Queen Beds"
    }
  },
  {
    "routerUrl": "discount-bedrooms/king-beds",
    "content": {
      "title": "Discount King Beds",
      "details": [
        "When you’re shopping for a new king bed, you’ll find that other furniture retailers offer low-quality products at extravagant prices. Shop with Rooms To Go Outlet instead, and see what it’s like to be treated like royalty. Our wide selection of discount king beds allows you to choose the right style to complement your bedroom without forking over a king’s ransom.",
        "Choose from an extensive variety of styles, such as practical storage bed frames, grand canopy beds, sophisticated paneled headboards, plush upholstered styles, and elegant sleigh beds. Colors and finishes range from gunmetal gray to rich oak and cherry wood veneers. With deals on both modern and classically styled pieces, you’re sure to find an inexpensive king bed that perfectly matches your bedroom’s existing style.",
        "Your home is your castle, so don’t settle for anything less than the best. Our overstock and unused floor model king beds on sale make it easy to find the perfect sleeping solution at an inexpensive price. Enhance your bedroom with a discount king bed from Rooms To Go Outlet today."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/King-Beds/_/N-8de"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/King-Beds/_/N-8de"
        }
      ],
      "categoryHierarchy": "Bedrooms > King Beds"
    }
  },
  {
    "routerUrl": "discount-bedrooms/dressers",
    "content": {
      "title": "Discount Dressers",
      "details": [
        "Rooms To Go Outlet is your source for great discount dressers at unbeatable prices. Whether you are looking for an inexpensive storage solution or simply want to give your room a style update, our discount dressers are the perfect addition to any bedroom. We offer a wide variety of weekly specials, time limited coupons, and daily discounts that don’t just save you money, they save you money on quality crafted furniture. Each dresser we stock is constructed to last and available at great prices thanks to closeout specials, unclaimed orders, warehouse overstocks, and floor samples.",
        "Our affordable dressers come in a variety of colors and finishes, from classic blacks and whites to beautiful cherries, espressos, and silvers. Go for the clean lines and modern features of our contemporary selections, or opt for the timeless look of traditional dressers that blend well with any room decor. Plus, each piece is built with durability in mind, with many models utilizing premium French and English dovetail drawer construction, so you’ll be able to enjoy your discount dresser for years to come. The best part is that our dressers are also designed to protect delicate items, since many of our models feature top drawers lined with felt.",
        "At Rooms To Go Outlet, we provide our customers with high quality discount dressers, all on sale at unmatchable prices. With such a vast selection, we’re confident that you will find a dresser that is perfect for your room’s design. Fit for any bedroom and any style preference, our overstock dressers can’t be beat. So look no further than Rooms To Go Outlet for your next dresser purchase."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "banners/dressers.jpg",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Dressers/_/N-8dh"
        },
        {
          "url": "banners/dressers_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Dressers/_/N-8dh"
        }
      ],
      "categoryHierarchy": "Bedrooms > Dressers"
    }
  },
  {
    "routerUrl": "discount-bedrooms/vanity-mirrors",
    "content": {
      "title": "Discount Vanity Mirrors",
      "details": [
        "Our selection of discount vanity mirrors at Rooms To Go Outlet is nothing short of astonishing. We provide you with high quality products made even more desirable by their outrageously affordable prices. Shopping our outlet stores is the smartest way to maximize your buying power, as we carry inexpensive mirrors suitable for every room, in every style, and perfect for people of all ages. Our overstock items and floor samples save you money without compromising quality.",
        "Shopping for a specific room theme or color palette? No need to fret. We stock plenty of options to fit well with any decor. In fact, our discount vanity mirrors are designed to blend in flawlessly with traditional, contemporary, casual, transitional, and even rustic looks. Solid black and white frames offer a touch of elegance, while dark and light wood-finished frames provide any wall with an eye-catching pop of style. We also cater to non-traditional interior designs with colors like seafoam green and gray.",
        "It’s no secret that our discounts and special deals are unbeatable. Each discount vanity mirror we stock is constructed of the finest materials, such as pine and cherry wood solids. So why pay full price when affordable, worthwhile options are available? Buy from Rooms To Go Outlet today for style and quality that’s unmatched by any competitor."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Dresser-Mirrors/_/N-8di"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Dresser-Mirrors/_/N-8di"
        }
      ],
      "categoryHierarchy": "Bedrooms > Dresser Mirrors"
    }
  },
  {
    "routerUrl": "discount-bedrooms/nightstands",
    "content": {
      "title": "Discount Nightstands",
      "details": [
        "Rooms To Go Outlet features a great selection of discount nightstands for your bedside storage needs. Our inventory of overstock furniture provides our customers with a variety of styles and finishes at inexpensive prices. Deals on unused floor models offer impressive discounts on our quality pieces.",
        "You’re sure to find the perfect nightstand for your bedroom when you shop at Rooms To Go Outlet. Choose from nightstands constructed from the finest wood solids, such as pine, birch and poplar, in styles ranging from trendy and contemporary to classic and traditional. We stock options to fulfill a range of storage needs, including nightstands with multiple drawers, shelves, or a combination of the two. Some options feature felt-lined top drawers to hold valuables, while others incorporate built-in electrical outlets and night lights.",
        "In addition to numerous styles and storage options, our selection of affordable nightstands lets shoppers choose from a broad variety of colors and finishes. Dark oak, rich cherry, and lightly distressed walnut are just a few popular wood finishes. The diverse color options guarantee you’ll find a discount nightstand that fits your personal style. At Rooms To Go Outlet, we’ll help you find a great nightstand at a great price."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Nightstands/_/N-8dj"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Nightstands/_/N-8dj"
        }
      ],
      "categoryHierarchy": "Bedrooms > Nightstands"
    }
  },
  {
    "routerUrl": "discount-bedrooms/chests",
    "content": {
      "title": "Discount Chests",
      "details": [
        "The wide selection of discount chests at Rooms To Go Outlet makes it easy to find the right storage solution for your bedroom. Deals on unclaimed orders, closeout specials, warehouse overstocks, and unused floor samples make it possible to shop for high quality bedroom furniture at inexpensive prices.",
        "We stock a wide variety of styles from traditional designs with rich finishes to contemporary options with sleek lines. And the best part: everything’s on sale! Make the most of your space by selecting discount chests with spacious drawers boasting enough room to store an entire wardrobe. Thanks to the vertical design, our discount chests each feature a small footprint while still providing ample storage space in your bedroom. Each of our affordable chests is constructed of durable wood materials, such as poplar and pine wood solids, and the drawers are built using English and/or French dovetail joints for superior strength and reliability.",
        "Many chests feature elegant hardware, embellishments, or special features that give them a stylish look while improving functionality. Between our selections of classic, modern, rustic, and tropical styles, you’re sure to discover a chest that suits your unique tastes. Shop at Rooms To Go Outlet to find a discount chest that’s perfect for your bedroom."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Chests/_/N-8dk"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Chests/_/N-8dk"
        }
      ],
      "categoryHierarchy": "Bedrooms > Chests"
    }
  },
  {
    "routerUrl": "discount-bedrooms/daybeds",
    "content": {
      "title": "Discount Daybeds",
      "details": [
        "At Rooms To Go Outlet, we have a large discount daybed selection with styles to match the existing decor of any home. Whether you’re looking for a comfortable lounging option or a guest bed for a spare room, the wide variety of inexpensive daybeds we have on sale makes it easy to find exactly what you’re looking for.",
        "The daybeds at Rooms To Go Outlet range from elegant, stylish pieces with wrought iron backs and trundle drawers to the simplistic, functional charm of models with rich wooden paneling. Including options with fabric upholstery, our discount daybeds come in a broad range of colors and finishes, further opening up the design possibilities for your home.",
        "Our inventory of overstock and floor model merchandise means big savings, and with such a wide variety to choose from, shopping for bedroom furniture has never been simpler. Shop at Rooms To Go Outlet and see how easy and inexpensive it can be to find your ideal daybed."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Daybeds/_/N-8df"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Daybeds/_/N-8df"
        }
      ],
      "categoryHierarchy": "Bedrooms > Daybeds"
    }
  },
  {
    "routerUrl": "discount-bedrooms/headboards",
    "content": {
      "title": "Discount Headboards",
      "details": [
        "A good headboard can complete the look of any bedroom. With the wide selection of styles on sale at Rooms To Go Outlet, you’re sure to find a deal on a discount headboard to bring the visual appeal of your room full circle.",
        "Experience the warm comfort of a plush velvet headboard or enjoy the sophisticated style of a linen one – the choice is yours. Color schemes and styles available in our overstock and discounted headboard selections range from neutral tones with understated accents to eye-catching colors with energetic patterns.",
        "While other furniture retailers may put big price tags on comfort, the inexpensive deals on discount headboards from Rooms To Go Outlet allow you to find the perfect piece of furniture for less. Bring home a stylish new headboard for your bedroom today."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Bedrooms/Headboards/_/N-8dg"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Bedrooms/Headboards/_/N-8dg"
        }
      ],
      "categoryHierarchy": "Bedrooms > Headboards"
    }
  },
  {
    "routerUrl": "discount-bedrooms/desks",
    "content": {
      "title": "Discount Desks",
      "details": [
        "Rooms To Go Outlet offers a wide selection of high-quality, stylish discount desks. Thanks to an inventory of one-of-a-kind items, as-is floor samples and manufacturer overstock, we are able to offer discount desks at incredibly inexpensive prices. With prices this low, there’s never been a better time to get organized and create the ideal home office or work station.",
        "Our desks come in a wide range of styles, such as contemporary, traditional, or rustic. Choose from affordable desks with attached bookshelves, cabinets, or built-in cubbies for additional storage. Regardless of style, each piece of furniture on sale at Rooms To Go Outlet is built from high-quality materials, such as wood solids, tempered glass, or metal, for a seamless blend of functionality and style.",
        "With selections offering a variety of useful features, you’re certain to find the perfect discount desk to suit your needs. We have computer desks with pull-out keyboard trays, desk sets with matching chairs, and even models with built-in electrical outlets and USB ports for charging electronic devices. Stop by a Rooms To Go Outlet store today to find a discount desk that’s right for your room."
      ],
      "images": [],
      "mainImage": {
        "url": "Bedroom_Header.jpg",
        "link": "https://www.roomstogo.com/furniture/Bedrooms/Queen-Bedroom-Sets/_/N-8db"
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/_/N-1dredcq"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/_/N-1dredcq"
        }
      ],
      "categoryHierarchy": "Accessories > Desks"
    }
  },
  {
    "routerUrl": "discount-leather/sofas",
    "content": {
      "title": "Discount Leather Sofas",
      "details": [
        "Those who love leather know that the feel and look is rivaled by no other material. At Rooms To Go Outlet, our attention to the latest styles and the artistic vision we use to craft our leather sofas ensures that you’ll find the perfect piece to complement your existing home decor. Need to outfit an entire room? No problem. We offer individual sofas on their own, as well as sofas that come as part of a complete room set. Select from warehouse overstock and gently used floor sample discount leather sofas, all available only at Rooms To Go Outlet.",
        "Leather not only looks and feels better than other materials, but it also lasts longer and is easy to clean. So your discount leather sofa will look great and function flawlessly for years to come. Choose from selections featuring track or rolled arms, wooden or metal legs, and classic or motion reclining seating. Our customers also enjoy choosing from various size and color options.",
        "We put effort into making sure our customers leave our stores happy, so each affordable leather sofa frame is crafted out of high quality wood materials. Buying from Rooms To Go Outlet is the best way to fill your house with superior furniture without worrying about how to make it to the next paycheck. Take home an inexpensive and comfortable discount leather sofa today."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Leather/Leather-Sofas/_/N-8ek"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Leather/Leather-Sofas/_/N-8ek"
        }
      ],
      "categoryHierarchy": "Leather > Leather Sofas"
    }
  },
  {
    "routerUrl": "discount-leather/leather-loveseats",
    "content": {
      "title": "Discount Leather Loveseats",
      "details": [
        "Rooms To Go Outlet has a great selection of discount leather loveseats on sale. With our inventory of unused floor samples, closeout specials, and manufacturer overstock items, finding the right combination of style and comfort has never been easier. Other retailers may charge large sums of money for leather loveseats, but our deeply discounted yet superb furniture allows you to add plush seating to your home for less.",
        "Each affordable loveseat is made with supple leather that feels buttery soft against the skin. From contoured seating to reclining bucket seats with cup holder armrests, you’re sure to find exactly what you’re looking for in an inexpensive leather loveseat. Fashion-minded shoppers will appreciate the color options we carry, including rich mahogany, modern white, black or terracotta red. Choose from comfy chic designs, including those with included accent pillows, tufted cushions, or pillowtop armrests. Or go for a sophisticated look with options featuring wooden legs, contrasting stitching detail, or decorative nailhead accents.",
        "Regardless of your personal tastes, we never make you compromise on style or comfort. Shop at Rooms To Go Outlet and pick out the perfect discount leather loveseat for you. We also provide the option of saving even more by purchasing an entire discounted living room set. You’ll absolutely love our deals."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Leather/Leather-Loveseats/_/N-8el"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Leather/Leather-Loveseats/_/N-8el"
        }
      ],
      "categoryHierarchy": "Leather > Leather Loveseats"
    }
  },
  {
    "routerUrl": "discount-leather/leather-chairs",
    "content": {
      "title": "Discount Leather Chairs",
      "details": [
        "Finding the perfect leather chair for your living room can be challenging. Most furniture retailers offer dull selections at extravagant prices, forcing you to choose between chairs that look good and those that are actually comfortable to sit in. Luckily, we have the solution at Rooms To Go Outlet. You never have to compromise between style, comfort, and quality because it’s easy to find premium, chic discount leather chairs on sale at our outlet locations. Save on manufacturer overstock items, closeout specials, and floor samples in great condition.",
        "Our wide-ranging selection encompasses every style from sophisticated traditional leather chairs with bronze-finished nailhead accents to modern swivel chairs with sleek, contemporary lines. Diverse color options make it easy to choose an affordable leather chair that matches your home decor, whether you prefer neutral tones like chestnut brown, slate, and cream or expressive hues such as blue, terracotta, and red. Many of our chairs include chic design elements such as exposed chrome supports, swivel stands, or traditional turned wooden legs.",
        "With our large variety of discount leather furniture, you’re sure to find an inexpensive chair upholstered in luxurious top grain leather for the right price. Shop at Rooms To Go Outlet and bring home a great looking, comfortable discount leather chair today."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Leather/Leather-Chairs/_/N-8ep"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Leather/Leather-Chairs/_/N-8ep"
        }
      ],
      "categoryHierarchy": "Leather > Leather Chairs"
    }
  },
  {
    "routerUrl": "discount-leather/leather-recliners",
    "content": {
      "title": "Discount Leather Recliners",
      "details": [
        "Looking to add a comfortable new seating option to your living room or den on a budget? Shop the extensive selection of discount leather recliners on sale at Rooms To Go Outlet. You’re sure to find a stylish, comfortable new recliner for your home at an inexpensive price thanks to our inventory of one-of-a-kind items, factory overstock furniture, and like-new floor samples.",
        "Whether you prefer the cozy traditional look of a glider recliner upholstered in rich mahogany leather or the modern look of a sleek recliner in a bold color palette, you’ll find great deals on leather recliners to suit your style. Color options range from neutral tones such as black, brown, and gray to vivid hues of red and white. You’re sure to sink into our affordable leather recliners, many with the full leg support of padover chaise style footrests and impossibly plush padded seats.",
        "When it comes to comfort, you can rest easy knowing that you never have to sacrifice quality at Rooms To Go Outlet. Many of our recliners are upholstered in the highest quality top grain leather for supple, stain-resistant durability. Don’t wait a moment longer. Stop by an outlet location near you to bring home the style and comfort of a discount leather recliner today."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Leather/Leather-Recliners/_/N-8eo"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Leather/Leather-Recliners/_/N-8eo"
        }
      ],
      "categoryHierarchy": "Leather > Leather Recliners"
    }
  },
  {
    "routerUrl": "discount-leather/reclining-sofas",
    "content": {
      "title": "Discount Leather Recliner Sofas",
      "details": [
        "When you purchase a discount leather reclining sofa from Rooms To Go Outlet, the money you save somehow makes your new furniture feel that much more comfy. Our outlet stores make it easy for you to find the right style of leather reclining sofa for your room at an affordable price you won’t be able to find anywhere else. With our diverse inventory of high-quality overstock models, floor samples and factory closeouts to choose from, adding a spot of comfort to your life has never been more simple or less expensive.",
        "You can find deals on discount leather reclining sofas in shades ranging from rich walnut to chic gray. Furthermore, all our leather reclining sofas feature comfort enhancing features such as padded seats, supportive backs, pillowtop armrests and chaise style footrests offering full leg support. You can even treat yourself to the ultimate level of comfort with Rooms To Go Outlet power reclining sofas, which gently lay back at the touch of a button.",
        "Come find the perfect leather reclining sofa on sale and bring home a reliable source of comfort that also makes a stylish statement. With such a large range of styles to choose from, you’re sure to find the right piece for a great price. Shop for discount leather reclining sofas at a Rooms To Go Outlet store near you."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Leather/Leather-Recliners/_/N-8eo"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Leather/Leather-Recliners/_/N-8eo"
        }
      ],
      "categoryHierarchy": "Leather > Leather Recliner Sofas"
    }
  },
  {
    "routerUrl": "discount-leather/leather-ottomans",
    "content": {
      "title": "Discount Leather Ottomans",
      "details": [
        "Unwinding and putting your feet up has never been easier or less expensive. At Rooms To Go Outlet, we offer a variety of discount leather ottomans that are sure to promote rest and relaxation in any room of your home. Thanks to our diverse selection of unclaimed orders, closeout specials, floor samples, and warehouse overstock, we offer only the best pieces at a fraction of the cost our competitors charge.",
        "Made from durable materials and featuring both wooden and metal accents, each of our inexpensive leather ottomans is designed to stand the test of time. Choose from elegant, traditional designs or sleek, contemporary options. We stock a variety of styles to ensure you’ll find something that’s perfect for any room decor. It’s easy to pick an ottoman that matches your existing furniture with available options in blacks, whites, browns, blues, and even reds. Each discount leather ottoman can be used to prop your feet or add an extra seat to your living room, bedroom, or hallway. Some of our ottomans even work great as a stylish substitute for a traditional cocktail table.",
        "The best part about our selection is that you can find an ottoman that instantly livens up any room in your house without devastating your bank account. With our exceptional discounts, you’re sure to find exactly what you want at affordable prices. So shop at your local Rooms To Go Outlet to see our extensive collection of discounted leather ottomans and take home the one you love today."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Leather/Leather-Ottomans/_/N-8eq"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Leather/Leather-Ottomans/_/N-8eq"
        }
      ],
      "categoryHierarchy": "Leather > Leather Ottomans"
    }
  },
  {
    "routerUrl": "discount-mattress/queen-mattresses",
    "content": {
      "title": "Discount Queen Mattress",
      "details": [
        "There’s a reason queen size mattresses are preferred to other options. With a 60 x 80 inch surface area, each of our discount queen mattresses provides ample room for comfortable slumber. Plus, at Rooms To Go Outlet, they’re so inexpensive that you’ll hardly have to dip into your bank account to bring one home. We have new deals on queen sets every week, and thanks to our extensive selection, you get to choose from discount queen mattress made with gel memory foam, individually wrapped coils, or a combination of the two.",
        "Finding which queen mattress is right for you is the first step. Whether you enjoy the indulgent luxury of a plush pillowtop mattress or the unwavering support of a firm mattress, Rooms To Go Outlet carries the exact comfort level you need. No mattress set is complete without the support of a box spring, so choose from multiple style foundations, including low profile box springs, to get the best night of sleep you’ve had in ages.",
        "Take a look at our overstock merchandise and floor samples to find quality, affordable mattresses on sale that come complete with perks like cooling gel-infused material placed right in the mattress quilting, the surface closest to your body. For your convenience, we also offer bed frames and mattress protectors at incredible prices found only in our outlet stores. Rooms To Go Outlet delivers quality with every purchase. Have a look at our discount queen mattresses. We know you’ll want to take advantage of the opportunity to pay bargain prices for top-quality products."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "banners/mattresses.jpg",
          "link": "https://www.roomstogo.com/furniture/Mattress/Queen-Mattress/_/N-8fl"
        },
        {
          "url": "banners/mattresses_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Mattress/Queen-Mattress/_/N-8fl"
        }
      ],
      "categoryHierarchy": "Mattress > Queen Mattress"
    }
  },
  {
    "routerUrl": "discount-mattress/king-mattresses",
    "content": {
      "title": "Discount King Mattress",
      "details": [
        "Your bed is a place to rest, relax, and recharge once the day is done, and a comfortable mattress can make all the difference. Rooms To Go Outlet offers discount king mattresses at affordable prices, finally making it possible to find a premium quality mattress on sale. Stop by our outlet locations to see just how inexpensive it can be to treat yourself to a good night’s rest.",
        "The luxury of plentiful sleeping space doesn’t have to be reserved for royalty. Especially if you sleep with a partner, it can be tough to find a mattress that provides restorative support, ample space, and top-notch comfort for a decent price. At Rooms To Go Outlet, we have a wide variety of affordable king size mattresses to choose from. With a new king size mattress, lack of ample sleep space will no longer be an issue in your household. During a visit to your nearest outlet store, you can find firm mattress options with individually wrapped titanium coils for full-body support with superior motion separation, or perhaps you’ll gravitate toward the indulgent feel of a gel-infused memory foam mattress for body-conforming comfort with a cool, refreshing feel. Pillowtop designs, plush cushioning, and supportive advanced memory foam models are also available.",
        "Our great selection of discount king size mattresses also allows you to customize how you get in and out of bed. Choose between standard or low-profile mattress sets for flexibility in the overall height of your bed. You can also find mattresses on sale with reinforced edges that make it easier to get in and out of bed, while also providing an increased usable sleep surface. Our inventory of one-of-a-kind items, factory overstock, closeout specials, and unused floor samples changes all the time, so don’t wait. Visit a Rooms To Go Outlet store today to find the discount king mattress of your dreams."
      ],
      "images": [],
      "mainImage": {
        "url": "matress.png"
      },
      "bannerImages": [
        {
          "url": "banners/mattresses.jpg",
          "link": "https://www.roomstogo.com/furniture/Mattress/King-Mattress/_/N-8fm"
        },
        {
          "url": "banners/mattresses_mobile.jpg",
          "link": "https://m.roomstogo.com/furniture/Mattress/King-Mattress/_/N-8fm"
        }
      ],
      "categoryHierarchy": "Mattress > King Mattress"
    }
  },
  {
    "routerUrl": "discount-home-decor/lamps",
    "content": {
      "title": "Discount Lamps",
      "details": [
        "Rooms To Go Outlet offers a large selection of discount lamps that are sure to brighten up every room in your house. By maintaining a sizable inventory of factory overstock items, unclaimed orders, unused floor samples, and closeout specials, we are able to offer high quality lamps at inexpensive prices.",
        "Our collection of affordable floor and table lamps allows fashion-minded customers to choose the right lighting solution for every room in their house. Selections include art-deco inspired brushed steel and glass floor lamps with vintage inspired cream or glass shades, expertly styled plaster bases with tropical accents and light linen shades, or even the warm tones of dark stained wood and embossed leather lamps topped with tapered beige shades. With bulb options ranging from 40 to 150 watts and many models featuring multiple brightness settings, finding the right balance between illumination and style has never been easier.",
        "The wide range of styles, colors, and bulb options allows you to pick out the right lighting source without having to spend a lot. Stop by a Rooms To Go Outlet store near you to brighten up your living space with a stylish discount lamp today."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Lamps/_/N-8cs"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Accessories/Lamps/_/N-8cs"
        }
      ],
      "categoryHierarchy": "Accessories > Lamps"
    }
  },
  { "routerUrl": "discount-home-decor/rugs",
    "content": {
      "title": "Discount Rugs",
      "details": [
        "Rugs are more than just fabric under your feet. The flair they bring to a room can be subtle and understated or as striking and remarkable as a Van Gogh painting on your wall. At Rooms To Go Outlet, we carry an array of discount rugs at extraordinary prices. Pick a rug from our overstock items or select from the pool of floor samples to capitalize on deals your friends won’t believe. Our quality, affordable rugs range from small studio sizes up to large 13-foot estate options.",
        "We have endless pattern and color choices that fit with both contemporary and traditional style aesthetics. Our rugs come in standard rectangular shapes as well as chic circles. Not to mention, each inexpensive rug is crafted from the finest materials we have access to and will complement the decor of any room in the house.",
        "Looking for a soft, shaggy option, or maybe an expertly crafted woven discount rug? Look no further than our selections made from durable materials like nylon, polyester, wool, silk, and cotton. And our featured items on sale are just as exquisite as their full-priced counterparts. Bring home a new favorite rug today and cherish it for years to come. Spend less and get more from Rooms To Go Outlet."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Rugs/_/N-8cr"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Accessories/Rugs/_/N-8cr"
        }
      ],
      "categoryHierarchy": "Accessories > Rugs"
    }
  },
  { "routerUrl": "discount-home-decor/silk-flowers",
    "content": {
      "title": "Discount Silk Flowers",
      "details": [
        "You can bring the lush look of fresh, green plants indoors without worrying about your lack of a green thumb thanks to the silk flower arrangements available at Rooms To Go Outlet. We have a great selection of high-quality silk florals on sale due to closeout specials, floor samples, and factory overstock. We pass the discounts on to you, meaning that finding the right arrangement of discount silk flowers for your room is easier and more inexpensive than ever.",
        "Our affordable silk flowers are made of high-quality materials and come in a wide array of styles. Find stunning imitations of ornamental plants such as tall grasses, ivies, ferns, and reeds, or choose from our selections of vibrant, eye-catching silk flowers like hydrangeas, orchids, and peonies. Add vibrant hues of garden greens, bright yellows, blushing pinks, and pastel blues to your room, all without the hassle of regular watering and upkeep.",
        "Arrangements also include high-quality stands and vases. Polished glass, decorative plaster urns, and scrolled metal planter stands are just a few display options you’ll find at Rooms To Go Outlet. So start shopping and bring home a discount silk flower set for that straight-from-the-garden look at a bargain price."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Silk-Florals/_/N-8cw"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Accessories/Silk-Florals/_/N-8cw"
        }
      ],
      "categoryHierarchy": "Accessories > Silk Florals"
    }
  },
  { "routerUrl": "discount-home-decor/throw-pillows",
    "content": {
      "title": "Discount Throw Pillows",
      "details": [
        "A pair of decorative throw pillows offers an easy, affordable way to add a touch of comfort and style to your living room. Some furniture retailers charge exorbitant prices for home decor, but at Rooms To Go Outlet, you can find great deals on discount throw pillows in a wide range of styles. We offer inexpensive pieces thanks to our inventory of unclaimed orders, one-of-a-kind items, factory overstocks, and floor samples.",
        "Each discount throw pillow is made of quality materials, providing a touch of soft comfort to your couch, chair, or bed. Styles range from muted, solid earth tones to vibrant, playful contemporary patterns and everything in between. Choose the perfect pair of pillows to express your personal tastes with attractive prints, flame stitching, raised chenille accents, or monochromatic pillow options.",
        "Arrangements also include high-quality stands and vases. Polished glass, decorative plaster urns, and scrolled metal planter stands are just a few display options you’ll find at Rooms To Go Outlet. So start shopping and bring home a discount silk flower set for that straight-from-the-garden look at a bargain price."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Accent-Pillows/_/N-8cv"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Accessories/Accent-Pillows/_/N-8cv"
        }
      ],
      "categoryHierarchy": "Accessories > Accent Pillows"
    }
  },
  { "routerUrl": "discount-home-decor/wall-art",
    "content": {
      "title": "Discount Wall Art",
      "details": [
        "No home should be without some kind of artistic expression. While art pieces can be pricey, Rooms To Go Outlet offers a huge selection of discount wall art ready to captivate your house guests and improve your everyday quality of life, all at incredibly affordable prices. Our aesthetically pleasing, ever-changing selections are often available in up to six matching pieces and represent a variety of artistic movements.",
        "Featured pieces take cues from some of the artistic greats of our time. Some of our featured artistic styles include impressionism, minimalism, and abstract concepts that are found in both the paintings and prints we offer. Framed photographs are available for purchase, as well. Sizes range from small, quaint pieces to large, grandiose displays of artistic excellence. Our affordable wall art on sale features scenic views, animal portraits, and images of contemporary life, as well as additional non-traditional themes.",
        "The color palettes represented in our wall art also vary in order to accommodate the range of style aesthetics found in our customers’ homes. Our inexpensive floor samples or overstock items offer an affordable way to bring quality art decorations into your living space. Step into the creative process and take home discount wall art from Rooms To Go Outlet to give your walls an instant refresh."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Wall-Decor/_/N-8ct"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Accessories/Wall-Decor/_/N-8ct"
        }
      ],
      "categoryHierarchy": "Accessories > Wall Decor"
    }
  },
  { "routerUrl": "discount-home-decor/accent-cabinet",
    "content": {
      "title": "Discount Accent Cabinet",
      "details": [
        "People tend to accumulate trinkets and knickknacks over the years: souvenirs from tropical vacations, keepsakes from school days and memorabilia that commemorate past events. Emotional attachment keeps you from throwing them out, but one question remains: what do you do with all of these personal treasures? Rooms To Go Outlet has the perfect, inexpensive solution for you. Each of our discount accent cabinets make exceptional space savers. With plenty of shelving and drawer space, you have the option of putting your baubles on display or tucking them away to be brought out at a later occasion for nostalgia’s sake.",
        "Compact and fashion-forward, our affordable accent cabinets can be added to any room in your home. Choose from playfully colored pieces in bold blues and reds or opt for traditional wood finishes. Show off your contemporary side with an accent cabinet that features multi-colored drawers or go for a simpler piece that blends into the background. Whatever you choose, we promise it’s made from quality and durable wood materials, so you can count on a place to store your keepsakes for years to come. Set a discount accent cabinet next to the big comfy chair in your library or make one the centerpiece in your foyer. No matter where it ends up in your home, we’re certain you’ll fall in love.",
        "We haven’t even told you the best part. Since the bulk of our inventory comes from warehouse overstock and like-new floor samples, we always have the best deals on stylish furniture. Save your money for another vacation and still afford to buy a few discount accent cabinets from Rooms To Go Outlet."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Accent-Cabinets/_/N-8cu"
        },
        {
          "url": "",
          "link": "https://m.roomstogo.com/furniture/Accessories/Accent-Cabinets/_/N-8cu"
        }
      ],
      "categoryHierarchy": "Accessories > Accent Cabinets"
    }
  },
  { "routerUrl": "discount-home-decor/storage-benches",
    "content": {
      "title": "Storage Benches",
      "details": [
        "Dual-function furniture can be a great way to save space, and our discount storage benches are no exception. These versatile benches give you the best of both worlds by offering comfortable seating and valuable storage space all in one. Choose from a wide variety of quality, affordable benches thanks to our supply of warehouse overstock, floor samples, unclaimed orders, and closeout specials. At Rooms To Go Outlet, our discount benches may be on sale, but that doesn’t mean they’re cheaply made.",
        "No matter what your room decor looks like, we stock high quality styles of benches to fit your needs. From traditional upholstered selections in beautiful pastels, blacks, and whites to beautiful, modern designs with bold patterns and brilliant color schemes, we’ve got the discount storage bench for you. They’re multi-purpose, too! Our inexpensive benches conveniently offer extra seating when guests are over while also providing storage space for blankets, books, and electronics. Additionally, the hinged top gives you easy access to whatever you’ve stored away.",
        "You should never have to compromise on style or price, and at Rooms To Go Outlet, we make sure you don’t. Visit our showrooms today for the perfect discount storage bench to complement any room in your home."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [
        {
          "url": "",
          "link": "https://www.roomstogo.com/furniture/Accessories/Accent-Benches/_/N-8d0"
        },
        {
          "link": "https://m.roomstogo.com/furniture/Accessories/Accent-Benches/_/N-8d0"
        }
      ],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/columbus/1074",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Deep Discounts in Columbus, GA<h3>",
        "Here at the top of the Chattahoochee River, most people know there's only one place to go for great discounts on amazing furniture. At your local Rooms To Go Outlet, we offer fantastic prices on mattresses, dining sets, living room suites, bedroom furniture, and so much more",
        "If you want to decorate your modern farmhouse or just need to add a touch of shabby chic to a bedroom, we have the furniture and home accents to complement your personal design. Come down and visit our nearby Rooms To Go Outlet serving Columbus and Muscogee county."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/pearlriver/926",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Louisiana's Low-Priced Furniture Outlet<h3>",
        "Serving the Metairie-Kenner metro area, our nearby Rooms To Go Outlet in Pearl River offers everything from cozy, southern styles to sleek, modern designs. We have updated furniture sets for living rooms, kitchens, and bedrooms with discount pricing to match every budget.",
        "Our store features a comfortable, hassle-free showroom and finance plans to ensure that every shopping experience with us is a good one. Whether you're looking to furnish a French Country home or a sweet shotgun cottage, you'll find everything you need at the local Pearl River Rooms To Go Outlet."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/fortworth/2908",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Quality and Style for Less with Rooms To Go Outlets<h3>",
        "Your local Fort Worth showroom has all the latest furniture styles and trends at discounted prices. Choose from a broad selection of furniture designs, from rustic to contemporary. Our collection caters to any look you desire, whether you're decorating a rambling Texas farmhouse or a cozy bungalow.",
        "Shop for deals on furniture sets or put together your own dream room from individual pieces. Our store features updated collections of discount furnishings with quality and value in mind. Need some help choosing the best style? Our friendly associates are here to help. You're sure to find something you love at the nearby Rooms To Go Outlet in Fort Worth."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/norcross/1095",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Overstock, Clearance, and Closeout Furniture in the Atlanta Area<h3>",
        "Conveniently located just south of Alpharetta and Roswell, the Rooms To Go Outlet in Norcross offers home decor and furniture at reduced prices. Open daily, this local store features affordable, well-made pieces to furnish your home from top to bottom.",
        "Browse name brand mattresses, bedroom sets, dining and living rooms suites, and more in styles from classic to contemporary. With financing options to suit every budget, we can match you with the perfect look at a reasonable price. For the best deals across Gwinnett County, try the Norcross Rooms To Go Outlet near you."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/houston/2904",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Houston/Willowbrook's Discount Furniture Store<h3>",
        "Smart shoppers around Bellaire, Piney Point Village, and Spring Valley already know about the Houston area's best stop for great deals on furniture. Check out the Rooms To Go Outlet experience for yourself when you visit our Houston/Willowbrook store. We feature low prices on everything from sofas and bedroom sets to dining tables and decor.",
        "<h3>A Style for Everyone</h3>",
        "Serving Northwest Houston, the Willowbrook outlet offers financing and delivery options on hundreds of clearance, closeout, and overstock items from your favorite brands. Whether your decorating tastes lean toward rustic western, southern traditional, coastal chic, or any of the city's other favorite styles, we have just the right piece for you."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/grandprairie/2901",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Rooms To Go Outlet in the Dallas-Fort Worth Area</h3>",
        "Shoppers looking for affordable furniture and decor in Grand Prairie will enjoy the selection at our Rooms To Go Outlet. Choose from stylish couches, dining sets, and decor perfect for any aesthetic. We offer bargain furnishings in designs ranging from chic and contemporary to rustic and charming",
        "Not only does our decor fit your style needs, it fits your budget, too. We feature high-quality pieces at low prices to take the stress out of furniture shopping. Finance and delivery options are also available. Stop into your local store to see why people from all over Grand Prairie and nearby Arlington, Irving, Grapevine choose Rooms To Go Outlet."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/pompanobeach/906",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Great Deals at the Heart of the Gold Coast</h3>",
        "Located between Boca Raton and Fort Lauderdale, our Rooms To Go Outlet in Pompano Beach has discounts on all your favorite furniture styles. By shopping these limited clearance items, you can furnish a room or a whole home for less. Our wide selection includes local favorites like nautical, coastal, Mediterranean, tropical, and modern decor.",
        "<h3>Quality and Service</h3>",
        "At Rooms To Go Outlet, we're about more than just savings. We gather closeout items from name brands with the quality construction that you look for. The home delivery and multiple financing options available at our Pompano Beach outlet store make it easy to shop on your terms and budget. From Pompano Beach Highlands to Palm Aire, you won't find a better deal."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/orangepark/921",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Discount Furniture in Orange Park</h3>",
        "The Rooms To Go Outlet in Orange Park, Florida is perfect for those searching for affordable, stylish pieces to furnish their home. Our showroom includes dining furniture, bedroom sets, sofas, decor, and more. Whether you're interested in Cape Cod style or Mediterranean revival design, we've got you covered.",
        "Buyers in Orange Park or nearby Fleming Island and Lakeside in the Jacksonville area can browse hundreds of pieces in different colors and styles at our outlet location. Open as late as 9 p.m., we also offer delivery to make buying furniture convenient and stress-free."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/tallahassee/927",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Discount Furniture Near You</h3>",
        "The vast selection on display at the Rooms To Go Outlet Tallahassee store is sure to have many choices you'll love. Our furnishings are priced to move, but built to last. With pieces for bedrooms, dining rooms, kitchens and more, we carry everything your home needs at a price that won't break the bank.",
        "<h3>Just the Right Look</h3>",
        "Our selection of discounted tables, chairs, sofas, rugs, and more come in styles to suit the unique personality of your home. Find pieces that radiate the refinement and charm of historic Tallahassee or suit the city's chic, more modern edge. Unmatched in variety and quality, this Rooms To Go Outlet is the Florida Panhandle's go-to furniture store."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/gainesville/929",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Discount Furniture in Gainesville</h3>",
        "This Rooms To Go Outlet serves residents of the Gainesville area from Keystone Heights to Newberry. We offer discount furniture in hundreds of styles fitting for anything from a Florida bungalow to a New American classic. Browse our showroom for affordable couches, bedrooms, and dining sets as well as decor and rugs.",
        "Open every day except major holidays, the Rooms To Go Out in Gainesville provides the convenience of shopping for all of your furniture in one place. Our items have deep discounts and come with financing options for budget-friendly buying. We also offer delivery, taking the hassle out of furnishing your home."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/seffner/901",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Seffner's One-Stop-Shop for Affordable Furniture</h3>",
        "Our Rooms To Go Outlet in Seffner sells discount couches, bed sets, dining room suites, and furniture for the entire home. Residents of the Parsons Pointe, Shangri La, Hickory Hill, and Lake Weeks communities as well as local shoppers from around the Tampa area browse our showroom for home furnishings and decor.",
        "<h3>Style and Convenience All in One Place</h3>",
        "The Seffner outlet brings you clearance and closeout furniture in the area's most popular styles. Decorators with tastes ranging from Mediterranean modern to New American and more will find great deals on quality pieces. Add in Rooms To Go Outlet's delivery and financing options, and furnishing a home can be quicker and easier than ever."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/brookshire/2905",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Budget-Friendly Furniture in Brookshire</h3>",
        "The Rooms To Go Outlet in Brookshire offers furniture for any design taste. We have farmhouse sets for a Craftsman cottage, modern decor for a chic apartment, and everything in-between. Shoppers from nearby Katy and Pattison and across the Houston area visit our showroom to find deals on mattresses, couches, dining sets, and more.",
        "We sell discount furniture with an eye towards durable construction and stand-out style. Shopping is easy at our Brookshire store with convenient delivery and financing plans. Furnish every room in your home with the options available at your local Rooms To Go Outlet."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/charlotte/1061",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Affordable Furniture in the Queen City</h3>",
        "For North Carolina residents looking to furnish their homes or apartments, the Rooms To Go Outlet in Charlotte is a must. We offer pieces in styles from Southern classic to modern industrial and anything that falls between. Whether you need a bedroom update, kitchen redo, or living room revival, we have the furniture and decor to complete your project.",
        "<h3>The Advantages of Outlet Shopping</h3>",
        "Charlotte locals from Ballantyne to Highland Creek and beyond choose Rooms To Go Outlet for our quality and prices. Buying at an outlet means finding deals on clearance and closeout items from top brands all in one place. Browse hundreds of affordable options and check out our financing offers at the showroom near you."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/dunn/1063",
  "content": {
    "title": "Store Locator",
    "details": [
      "<h3>Your Local Spot for Discount Furniture</h3>",
      "Shoppers across the Raleigh-Cary area choose the Rooms To Go Outlet in Dunn for quality furniture at bargain prices. With the option to buy coordinated sets or individual pieces, the design possibilities are endless. Our showroom features a wide variety of styles to suit the traditional Southern decorator, the contemporary trend-setter, and everyone in-between.",
      "<h3>The Rooms To Go Outlet Difference</h3>",
      "At our Dunn location, we gather quality clearance and closeout furniture to offer savvy decorators the look the want at a price they can afford. Furnish one room or your entire house when you take advantage of our financing and home delivery service. With so many great deals, it's clear why people from Smithfield to Eastover shop with us."
    ],
    "images": [],
    "mainImage": {
      "url": ""
    },
    "bannerImages": [],
    "categoryHierarchy": "Accessories > Accent Benches"
  }
},
  { "routerUrl": "stores/forestpark/1071",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>The Atlanta Area's Affordable Furniture Supplier</h3>",
        "The Rooms To Go Outlet in Forest Park, GA, has furniture suited for every taste. Whether you're furnishing a cozy townhouse or a colonial estate, we've got the perfect bedroom sets, dining tables, sofas, and decor. Home decorators from East Point to Jonesboro choose our store to find well-made, low-cost pieces for any room in the house.",
        "To furnish your home for just a fraction of the cost, visit the Rooms To Go Outlet near you in Forest Park. Our showroom lets you browse budget-friendly furniture in hundreds of styles and colors. Delivery and finance options are also available to suit your budget and schedule."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  {
    "routerUrl": "stores/gretna/925",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Decorating on a Budget in the New Orleans Area</h3>",
        "Come shop the wide selection of discounted furniture at our Gretna showroom. You're sure to find beautiful pieces in styles to suit any home from the historic colonials of the West Bank to the midcentury gems in Lake Vista. We offer furnishings to complete your living room, dining room, or bedroom with decor you'll love.",
        "Our collection includes design options from rustic to modern and everything in-between. Browse through sets or individual items, including beds, chairs, lamps, tables, and many other items that will look great in your home. Find the best furnishings at the lowest prices today at your local Rooms To Go Outlet in Gretna."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/humble/2909",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Stylish Discount Furniture Near Houston</h3>",
        "Located just north of Houston, our Rooms To Go Outlet in Humble offers hundreds of options for the home decorator on a budget. Go back to local design roots with Mission, industrial, and farmhouse decor or choose pieces with contemporary and modern appeal. We offer furniture in styles to suit any aesthetic at a deep discount.",
        "<h3>Why Shop Rooms To Go Outlets?</h3>",
        "Our stores gather quality pieces from the best clearance, closeout, and overstock furniture sales so you don't have to. The Humble outlet brings together affordable couches, desks, bedroom sets, dining tables, and more all in one location. Make furnishing a room or a whole house simple with a trip to the Rooms To Go Outlet near you."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "stores/palmbeachgardens/930",
    "content": {
      "title": "Store Locator",
      "details": [
        "<h3>Discount Furniture in Palm Beach Gardens</h3>",
        "Visit the Rooms To Go Outlet in Palm Beach Gardens for discount furniture to fit any aesthetic. Everyone from local Spanish revival homeowners to Mediterranean modern stylists can find pieces they love. Visitors from all over the Miami metro area turn to us for affordable and trendy bedroom sets, sofas, dining tables, and much more.",
        "<h3>Shopping with Rooms To Go Outlet</h3>",
        "With a large selection of closeout furniture and attractive financing options, we make decorating your home easy and manageable. Join the shoppers from nearby Jupiter, West Palm Beach, and Lake Worth who begin their search for home decor at our Palm Beach Gardens outlet store."
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": [],
      "categoryHierarchy": "Accessories > Accent Benches"
    }
  },
  { "routerUrl": "/",
    "content": {
      "title": "Rooms To Go Outlet Home Page",
      "details": [
        "Welcome to the Rooms To Go furniture Outlet site! The special offers on this site can be used at any of our furniture outlets to help you find discount items and cheap furniture or home decor. Every week you can go online and download or print our latest flyer for warehouse closeouts and clearance sales (coupons are sometimes available).",
        "In the market for home furnishings priced below market value? Wondering where or how you can find cheap home furniture for sale? This is the place to start. Review our flyer to find great deals on the pieces you need to make your house feel more like home. Visitors to our outlet stores may select from durable, eye-catching, and functional items priced below market value.",
        "Also, check out Roomstogo.com and RoomstogoKids.com where you can find the best pieces to complete bedrooms, living rooms, dens, foyers, bathrooms, and just about every other room in the house.",
        "Here are some of the special events that this site will alert you:",
        "<ul><li>unclaimed orders</li><li>floor samples</li><li>one of a kind items</li><li>room discounts</li><li>closeout specials</li><li>manufacturer’s closeouts</li><li>weekly specials and deep discounts</li><li>limited quantities</li><li>items available for immediate pickup</li><li>warehouse only sale product</li><li>warehouse overstocks</li><li>mattress closeouts</li><li>special buys</li><li>deep discounted furniture</li><li>under cost prices</li><li>“the more you buy the more you save”</li><li>Serta mattress specials Coupon saving events</li></ul>"
      ],
      "images": [],
      "mainImage": {
        "url": ""
      },
      "bannerImages": []
    },
    "categoryHierarchy": ""
  }
]
